export default /* md */ `---
title: @@title
---

# @@title @@code

## 功能介绍

@@title 组件

## 使用方式

<br />
<@@codeUse1 />

::: details 查看代码

<<< @/examples/@@name/use1.vue

:::

## API 参考

### 属性

| 名称 | 说明 | 类型 | 默认值 |
| :--: | :--: | :--: | :----: |
|  -   |  -   |  -   |   -    |

### 事件

| 名称 | 说明 | 触发时机 | 回调类型 |
| :--: | :--: | :------: | :------: |
|  -   |  -   |    -     |    -     |

### 插槽

| 名称 | 说明 | 类型定义 |
| :--: | :--: | :------: |
|  -   |  -   |    -     |

### 实例

| 成员 | 说明 | 类型定义 |
| :--: | :--: | :------: |
|  -   |  -   |    -     |

<script setup>
import @@codeUse1 from './use1.vue';
</script>
`;
